xml-utils/resources/soapInhibition.xml

<env:Envelope xmlns:env="http://schema.xmlsoap.org/soap/envelope">
  <env:Body>
    <mfg:CreateAutoSpeedByTemplateConfirmation 
    	xmlns:mfg="http://tosun.com/mfg/mfg_cars/MFGCARS_MANAGECNSTR">
      <BizObjDoc>
        <additionalAttribute>
          <attributeName>uuid</attributeName>
          <attributeValue>e38f0064-4074-4d9a-8a81-13f685b4e960</attributeValue>
        </additionalAttribute>
        <manufactureRuleList>
          <action>PreView</action>
          <wheelId>#1</wheelId>
          <purposeType>PM</purposeType>
          <carId>LexusRX</carId>
          <uploadResult>
            <inhibitEntity>
              <endTime>2018-07-03T09:00:00.0+08:00</endTime>
              <extendAttribute>
                <extendAttributeName>EngineType</extendAttributeName>
                <extendAttributeValue>ABC_KKK.E*</extendAttributeValue>
              </extendAttribute>
              <extendAttribute>
                <extendAttributeName>leadingChar</extendAttributeName>
                <extendAttributeValue>*</extendAttributeValue>
              </extendAttribute>
              <extendAttribute>
                <extendAttributeName>allowance</extendAttributeName>
                <extendAttributeValue>N</extendAttributeValue>
              </extendAttribute>
              <extendAttribute>
                <extendAttributeName>subLineType</extendAttributeName>
                <extendAttributeValue>*</extendAttributeValue>
              </extendAttribute>
              <memo>[PM]Auto Speed by TEST 1</memo>
              <reasonCode>OTIS</reasonCode>
              <startTime>2017-07-03T09:00:00.0+08:00</startTime>
            </inhibitEntity>
            <uuID>0</uuID>
          </uploadResult>
          <uploadResult>
            <inhibitEntity>
              <endTime>2018-07-03T09:00:00.0+08:00</endTime>
              <extendAttribute>
                <extendAttributeName>EngineType</extendAttributeName>
                <extendAttributeValue>TEST.E*</extendAttributeValue>
              </extendAttribute>
              <extendAttribute>
                <extendAttributeName>leadingChar</extendAttributeName>
                <extendAttributeValue>*</extendAttributeValue>
              </extendAttribute>
              <extendAttribute>
                <extendAttributeName>allowance</extendAttributeName>
                <extendAttributeValue>N</extendAttributeValue>
              </extendAttribute>
              <extendAttribute>
                <extendAttributeName>subLineType</extendAttributeName>
                <extendAttributeValue>*</extendAttributeValue>
              </extendAttribute>
              <memo>[PM]Auto Speed by TEST 2</memo>
              <reasonCode>OTIS</reasonCode>
              <startTime>2017-07-03T09:00:00.0+08:00</startTime>
            </inhibitEntity>
            <uuID>1</uuID>
          </uploadResult>
          <uploadResult>
            <inhibitEntity>
              <endTime>2018-07-03T09:00:00.0+08:00</endTime>
              <extendAttribute>
                <extendAttributeName>leadingChar</extendAttributeName>
                <extendAttributeValue>*</extendAttributeValue>
              </extendAttribute>
              <extendAttribute>
                <extendAttributeName>allowance</extendAttributeName>
                <extendAttributeValue>N</extendAttributeValue>
              </extendAttribute>
              <extendAttribute>
                <extendAttributeName>subLineType</extendAttributeName>
                <extendAttributeValue>*</extendAttributeValue>
              </extendAttribute>
              <memo>[PM]Auto Speed by TEST 3</memo>
              <reasonCode>OTIS</reasonCode>
              <startTime>2017-07-03T09:00:00.0+08:00</startTime>
            </inhibitEntity>
            <uuID>2</uuID>
          </uploadResult>
        </manufactureRuleList>
        <retCode>
          <reasonText>Normal End</reasonText>
          <returnCode>0</returnCode>
        </retCode>
      </BizObjDoc>
    </mfg:CreateAutoSpeedByTemplateConfirmation>
  </env:Body>
</env:Envelope>

